#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Reading...[0m[0m
[0m[1maws_ce_anomaly_monitor.monitor2: Refreshing state... [id=arn:aws:ce::199660179115:anomalymonitor/9f624c10-990b-4580-8af9-0a8914bc7966][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Read complete after 1s [id=1789900679][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 1s [id=199660179115][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Read complete after 0s [id=1243534753][0m
[0m[1maws_iam_role.github_deployment_oidc_role: Refreshing state... [id=github-deployment-oidc-role][0m
[0m[1maws_ce_anomaly_subscription.test: Refreshing state... [id=arn:aws:ce::199660179115:anomalysubscription/b795bd02-64c8-4dc4-8fd4-08f5df946485][0m
[0m[1maws_iam_role_policy.github_actions_role_policy: Refreshing state... [id=github-deployment-oidc-role:github_deployment_oidc_role_policy][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # aws_ce_anomaly_monitor.service_monitor1[0m will be created
[0m  [32m+[0m[0m resource "aws_ce_anomaly_monitor" "service_monitor1" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m monitor_dimension = "SERVICE"
      [32m+[0m[0m monitor_type      = "DIMENSIONAL"
      [32m+[0m[0m name              = "AWSServiceMonitor1"
      [32m+[0m[0m tags_all          = (known after apply)
    }

[1m  # aws_ce_anomaly_subscription.test[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ce_anomaly_subscription" "test" {
        id               = "arn:aws:ce::199660179115:anomalysubscription/b795bd02-64c8-4dc4-8fd4-08f5df946485"
      [33m~[0m[0m monitor_arn_list = [] -> (known after apply)
        name             = "DAILYSUBSCRIPTION"
        tags             = {}
        [90m# (4 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dtaylor77, Action: `pull_request`, Workflow: `Aquanow Infrastructure DEV Pipeline`*